RIET/src/DataProcessors/rgsИнтеграцияСERM/rgsИнтеграцияСERM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>rgsИнтеграцияСERM</name>
</mdclass:DataProcessor>

RIET/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <comment>(Общ)</comment>
  <basedOn>Catalog.Организации</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОсновнойДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <comment>(Регл) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеКонтактноеЛицо</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>LawsonID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеEnglish</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентLawson</name>
    <type>
      <types>CatalogRef.КонтрагентыLawson</types>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КППВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенноеПредставлениеИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширенноеПредставлениеКПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапретаИспользования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодКлассификатора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/DataProcessors/rgsИнтеграцияСERM/Forms/ФормаЗаявки/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// { RGS VShamin 04.05.2016 12:52:32 - 
	//Параметры.Свойство("Код", Код);
	//Параметры.Свойство("Дата", Дата);
	//Параметры.Свойство("ВидОперации", ВидОперации);
	//Параметры.Свойство("СостояниеЗаявки", СостояниеЗаявки);
	//Параметры.Свойство("ИзменяемыйКлиент", ИзменяемыйКлиент);
	//Параметры.Свойство("Инициатор", Инициатор);
	//Параметры.Свойство("Комментарий", Комментарий);
	//Параметры.Свойство("Ссылка", Ссылка);
	Если НЕ Параметры.НоваяЗаявка Тогда
		Параметры.Свойство("Наименование", Наименование);
		Параметры.Свойство("Код", Код);
		Параметры.Свойство("Дата", Дата);
		Параметры.Свойство("ВидОперации", ВидОперации);
		Параметры.Свойство("СостояниеЗаявки", СостояниеЗаявки);
		Параметры.Свойство("ИзменяемыйКлиент", ИзменяемыйКлиент);
		Параметры.Свойство("Инициатор", Инициатор);
		Параметры.Свойство("Комментарий", Комментарий);
		Параметры.Свойство("Ссылка", Ссылка);
	Иначе
		Элементы.Наименование.ТолькоПросмотр = Ложь;
		Элементы.Дата.ТолькоПросмотр = Ложь;
		Элементы.ВидОперации.ТолькоПросмотр = Ложь;
		СостояниеЗаявки = "Новая";
		ВидОперации = "РегистрацияНовогоОбъекта";
		Элементы.ИзменяемыйКлиент.ТолькоПросмотр = Ложь;
		Элементы.Комментарий.ТолькоПросмотр = Ложь;
		Элементы.ФормаЗаписать.Доступность = Истина;
		Инициатор = глЗначениеПеременной("глТекущийПользователь");
		Дата = ТекущаяДата();
	КонецЕсли;
	
	УзелОбмена = ПланыОбмена.rgsОбменКлиентамиЧерезУниверсальныйФормат.ПолучитьУзелОбменаСERM();
	
	УстановитьВидимостьИзменяемогоКлиента();
	// } RGS VShamin 04.05.2016 12:52:32 - 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрисоединенныеФайлы(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Заявка", Ссылка);
	ПараметрыФормы.Вставить("УзелОбмена", УзелОбмена);
	ОткрытьФорму("Обработка.rgsИнтеграцияСERM.Форма.ФормаЗаявкиПрисоединенныеФайлы", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

// { RGS VShamin 04.05.2016 13:49:03 - 
&НаКлиенте
Процедура Записать(Команда)
	
	Если ПроверкаЗаполненияОбязательныхПолей() Тогда
		Возврат;
	КонецЕсли;
	
	УспешнаяОтправка = ОтправитьЗапросНаСозданиеЗаявки();
	ЭтаФорма.Закрыть(УспешнаяОтправка);
	
КонецПроцедуры // } RGS VShamin 04.05.2016 13:49:03 - 

// { RGS VShamin 04.05.2016 15:16:53 - 
&НаСервере
Функция ОтправитьЗапросНаСозданиеЗаявки()

	WSСсылка = WSСсылки.rgsИнтеграцияСERM;
	ФабрикаXDTOERM = WSСсылка.ПолучитьWSОпределения().ФабрикаXDTO;
	WSПрокси = Обработки.rgsИнтеграцияСERM.СоздатьWSПрокси(УзелОбмена, WSСсылка);
	
	#Область НастройкаКомпонентовОбмена
	КомпонентыОбмена = ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена("Отправка");
	КомпонентыОбмена.УзелКорреспондента = УзелОбмена;
	КомпонентыОбмена.ВерсияФорматаОбмена = ОбменДаннымиXDTOСервер.ВерсияФорматаОбменаПриВыгрузке(УзелОбмена);
	ФорматОбмена = ОбменДаннымиXDTOСервер.ФорматОбмена(
		УзелОбмена, КомпонентыОбмена.ВерсияФорматаОбмена
	);
	КомпонентыОбмена.XMLСхема = ФорматОбмена;
	КомпонентыОбмена.МенеджерОбмена = ОбменДаннымиXDTOСервер.МенеджерОбменаВерсииФормата(
		УзелОбмена, КомпонентыОбмена.ВерсияФорматаОбмена
	);
	КомпонентыОбмена.ТаблицаПравилаРегистрацииОбъектов = ОбменДаннымиXDTOСервер.ПравилаРегистрацииОбъектов(УзелОбмена);
	КомпонентыОбмена.СвойстваУзлаПланаОбмена = ОбменДаннымиXDTOСервер.СвойстваУзлаПланаОбмена(УзелОбмена);
	ОбменДаннымиXDTOСервер.ИнициализироватьТаблицыПравилОбмена(КомпонентыОбмена);
	#КонецОбласти
	
	Если ЗначениеЗаполнено(ИзменяемыйКлиент) Тогда
		
		ПравилоКонвертацииКонтрагентОтправка = КомпонентыОбмена.ПравилаКонвертацииОбъектов.Найти("Справочник_Контрагенты_Отправка", "ИмяПКО");
		СтруктураXDTOКлиент = ОбменДаннымиXDTOСервер.ДанныеXDTOИзДанныхИБ(КомпонентыОбмена, ИзменяемыйКлиент, ПравилоКонвертацииКонтрагентОтправка);
		КлиентXDTO = Обработки.rgsИнтеграцияСERM.ПолучитьОбъектXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.0", "Справочник.Контрагенты");
		ТипКлиентаXDTO = Обработки.rgsИнтеграцияСERM.ПолучитьТипОбъектаXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.0", "Справочник.Контрагенты");
		КонтрагентXDTO = ОбменДаннымиXDTOСервер.ОбъектXDTOИзДанныхXDTO(КомпонентыОбмена, СтруктураXDTOКлиент, ТипКлиентаXDTO, КлиентXDTO);
		
		КонтрагентXDTOERM = ТрансляцияXDTOСлужебный.ТранслироватьОбъект(КонтрагентXDTO, ФабрикаXDTOERM);
		
	КонецЕсли;
	
	ПравилоКонвертацииПользовательОтправка = КомпонентыОбмена.ПравилаКонвертацииОбъектов.Найти("Справочник_Пользователи_Отправка", "ИмяПКО");
	СтруктураXDTOПользователь = ОбменДаннымиXDTOСервер.ДанныеXDTOИзДанныхИБ(КомпонентыОбмена, Инициатор, ПравилоКонвертацииПользовательОтправка);
	ПользовательXDTO = Обработки.rgsИнтеграцияСERM.ПолучитьОбъектXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.0", "Справочник.Пользователи");
	ТипПользователяXDTO = Обработки.rgsИнтеграцияСERM.ПолучитьТипОбъектаXDTO(ФабрикаXDTO, "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.0", "Справочник.Пользователи");
	ПользовательXDTO = ОбменДаннымиXDTOСервер.ОбъектXDTOИзДанныхXDTO(КомпонентыОбмена, СтруктураXDTOПользователь, ТипПользователяXDTO, ПользовательXDTO);
	
	ПользовательXDTOERM = ТрансляцияXDTOСлужебный.ТранслироватьОбъект(ПользовательXDTO, ФабрикаXDTOERM);
	
	ПользовательXDTOERMКлючевыеСвойстваСФизЛицом = Обработки.rgsИнтеграцияСERM.ПолучитьОбъектXDTO(ФабрикаXDTOERM, "http://v8.1c.ru/edi/edi_stnd/EnterpriseData/1.0", "КлючевыеСвойстваПользователь");
	ПользовательXDTOERMКлючевыеСвойстваСФизЛицом.Ссылка = ПользовательXDTOERM.КлючевыеСвойства.Ссылка;
	ПользовательXDTOERMКлючевыеСвойстваСФизЛицом.Наименование = ПользовательXDTOERM.КлючевыеСвойства.Наименование;
	
	ПараметрыСозданияЗаявки = Обработки.rgsИнтеграцияСERM.ПолучитьОбъектXDTO(ФабрикаXDTOERM, "http://v8.1c.ru/edi/edi_stnd/EnterpriseDataAddition/1.0", "ПараметрыСозданияЗаявки");
	ПараметрыСозданияЗаявки.Наименование = Наименование;
	ПараметрыСозданияЗаявки.ДатаЗаявки = Дата;
	ПараметрыСозданияЗаявки.ВидОперации = ВидОперации;
	Если ЗначениеЗаполнено(ИзменяемыйКлиент) Тогда
		ПараметрыСозданияЗаявки.ИзменяемыйКлиент = КонтрагентXDTOERM.КлючевыеСвойства;
	КонецЕсли;
	ПараметрыСозданияЗаявки.Инициатор = ПользовательXDTOERMКлючевыеСвойстваСФизЛицом;
	ПараметрыСозданияЗаявки.СостояниеЗаявки = СостояниеЗаявки;
	ПараметрыСозданияЗаявки.Комментарий = Комментарий;
	ПараметрыСозданияЗаявки.ИдентификаторКорреспондента = УзелОбмена.Код;
	
	Попытка
		РезультатСозданияЗаявки = WSПрокси.CreateRequest(ПараметрыСозданияЗаявки);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Обработки.rgsИнтеграцияСERM.ОбработатьТекстОшибки(ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	Если НЕ ПустаяСтрока(РезультатСозданияЗаявки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатСозданияЗаявки);
		Возврат Ложь;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заявка успешно создана!");
		Возврат Истина;
	КонецЕсли;

КонецФункции // } RGS VShamin 04.05.2016 15:16:53 - 

// { RGS VShamin 04.05.2016 14:48:44 - 
&НаКлиенте
Функция ПроверкаЗаполненияОбязательныхПолей()

	Отказ = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле ""Дата""!");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле ""Вид операции""!");
		Отказ = Истина;
	ИначеЕсли (ВидОперации = "ИзменениеРеквизитовОбъекта" ИЛИ ВидОперации = "УдалениеОбъекта"
		ИЛИ ВидОперации = "УдалениеДубликатаОбъекта") И НЕ ЗначениеЗаполнено(ИзменяемыйКлиент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено обязательное поле ""Изменяемый клиент""!");
		Отказ = Истина;
	КонецЕсли;
	
	Возврат Отказ;

КонецФункции // } RGS VShamin 04.05.2016 14:48:44 - 

// { RGS VShamin 11.05.2016 12:45:07 - 
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьИзменяемогоКлиента();
	
КонецПроцедуры // } RGS VShamin 11.05.2016 12:45:07 - 

// { RGS VShamin 11.05.2016 12:45:07 - 
&НаСервере
Процедура УстановитьВидимостьИзменяемогоКлиента()
	
	Если НЕ ЗначениеЗаполнено(ВидОперации) ИЛИ ВидОперации = "РегистрацияНовогоОбъекта" Тогда
		Элементы.ИзменяемыйКлиент.Видимость = Ложь;
		ИзменяемыйКлиент = Справочники.Контрагенты.ПустаяСсылка();
	Иначе
		Элементы.ИзменяемыйКлиент.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры // } RGS VShamin 11.05.2016 12:45:07 -
